#### WorksetId Constructor

---

|  |
| --- |
| WorksetId Class   See Also |

Create an WorksetId handle with the given integer id.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public WorksetId( 	int id ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	id As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: WorksetId( 	int id ) ``` |

#### Parameters

id
:   Type:  System Int32
     The id.

# See Also

WorksetId Class

Autodesk.Revit.DB Namespace